
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОргИд = Формат(ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ОргИд, "ЧГ=0");
	СтореИд = Формат(ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение.СтореИд, "ЧГ=0");
	Если ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование Тогда
		ПлэсеИд = Формат(ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Значение.ПлэсеИд, "ЧГ=0");
	Иначе
		ПлэсеИд = 0;
	КонецЕсли;      	
	ДатаНачала = Формат(ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[3].Значение.ДатаНачала, "ДФ='yyyy-MM-dd hh:mm:ss'");
	ДатаОкончания = Формат(ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[3].Значение.ДатаОкончания, "ДФ='yyyy-MM-dd hh:mm:ss'");
	ЕдиницыКоличества = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[4].Значение;
	СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("select public.final_report_tn_iedf('%1', '%2', %3, %4, %5, %6);",
	ДатаНачала, ДатаОкончания, ОргИд, ПлэсеИд, СтореИд, Строка(ЕдиницыКоличества));
	ТЗ = ОИМЦ_Данные.ЗапросДанных63РазобратьСтроку(СтрокаЗапроса);	
	Если ТЗ <> Неопределено Тогда
		ЗаменаТипа(ТЗ);
		Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
		ВнешнийНаборДанных = Новый Структура("ВнешняяТаблица", ТЗ); //Внешний набор данных записываем в структуру, где ключ = имени внешнего набора данных в СКД 
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); //Устанавливаем в СКД внешний набор данных
		ДокументРезультат.Очистить();
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	КонецЕсли;                                         	
КонецПроцедуры

Процедура ЗаменаТипа(ТЗ)
	Для каждого Элемент Из ТЗ Цикл
		Если Элемент.N11 = "" Тогда
			Элемент.N11 = 0;
		Иначе
			Элемент.N11 = Число(Элемент.N11); 
		КонецЕсли;
		Если Элемент.N10 = "" Тогда
			Элемент.N10 = 0;
		Иначе
			Элемент.N10 = Число(Элемент.N10); 
		КонецЕсли;
		Если Элемент.N9 = "" Тогда
			Элемент.N9 = 0;
		Иначе
			Элемент.N9 = Число(Элемент.N9); 
		КонецЕсли;
		Если Элемент.N8 = "" Тогда
			Элемент.N8 = 0;
		Иначе
			Элемент.N8 = Число(Элемент.N8); 
		КонецЕсли;
		Если Элемент.N7 = "" Тогда
			Элемент.N7 = 0;
		Иначе
			Элемент.N7 = Число(Элемент.N7); 
		КонецЕсли;
		Если Элемент.N6 = "" Тогда
			Элемент.N6 = 0;
		Иначе
			Элемент.N6 = Число(Элемент.N6); 
		КонецЕсли;
		Если Элемент.N5 = "" Тогда
			Элемент.N5 = 0;
		Иначе
			Элемент.N5 = Число(Элемент.N5); 
		КонецЕсли;
		Если Элемент.N4 = "" Тогда
			Элемент.N4 = 0;
		Иначе
			Элемент.N4 = Число(Элемент.N4); 
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры


